app/controllers/voluntarios_controller.rb

SELECT  "voluntarios".* FROM "voluntarios" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "voluntarios"
---
  def index
    @search = Voluntario.search(params[:q])
    @voluntarios = @search.result.paginate(:page => params[:page], per_page: 10)